Revit 2026 API

# RebarShapeIsSameShapeIgnoringTerminations Method

---

Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSameShapeIgnoringTerminations(
	RebarShape otherShape
)
```
```vb
Public Function IsSameShapeIgnoringTerminations (
	otherShape As RebarShape
) As Boolean
```
```cpp
public:
bool IsSameShapeIgnoringTerminations(
	RebarShape^ otherShape
)
```
```fsharp
member IsSameShapeIgnoringTerminations :
        otherShape : RebarShape -> bool
```

#### Parameters

otherShape RebarShape
     Another shape to be compared to this one.

#### Return Value

Boolean True if the shape definitions match, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method will return true if the definitions are exactly equivalent. The hooks, cranks, end treatments, orientations and terminations' rotation angles are ignored.

#### Reference

RebarShape Class

Autodesk.Revit.DB.Structure Namespace